#include <stdio.h> 
#include <limits.h> 
/*
逻辑符号:
&&:逻辑与 ,都为真则为真
||:逻辑或,只要一个为真则为真
适合多个条件判断使用

&& >||
*/
int main(int argc,const char* argv[])
{
    //int a=9;
    //int b=20;
    // if(a>8 || b<15 && a+b>20)
    // {
    //     printf("ok\n");
    // } 
    // else
    // {
    //     printf("no\n");
    // }

    //短路问题
    //&&:只要前面条件为假,后面语句不再执行
    //||:只要前面条件为真,后面语句不再执行
    //if(b++<15 && a+++b++>20);
   // if(b++>15 || a+++b++>20);
    //if(b++<15 || a+++b++>20);
   // printf("%d\t%d\n",a,b);

   //张三说李四说谎,李四说王五说谎,王五说张三和李四都说慌
//    int a;
//    int b;
//    int c;
//    for(a=0;a<=1;a++)
//    {
//        for(b=0;b<=1;b++)
//        {
//            for(c=0;c<=1;c++)
//            {
//                if((a==1&& b==0 ||  a==0&&b==1) &&
//                   (b==1&& c==0 ||  b==0&&c==1) &&
//                   (c==1&& a+b==0 || c==0&& a+b>0))
//                {
//                     printf("a=%d\tb=%d\tc=%d\n",a,b,c);
//                }
//            }
//        }
//    }
   //100文钱买100只鸡,公鸡5元一只,母鸡3元一只,1元买3只小鸡
   int a,b,c;
   for(a=1;a<20;a++)
   {
       for(b=1;b<33;b++)
       {
           for(c=1;c<100;c++)
           {
               if(5*a+3*b+c==100 && a+b+3*c==100)
               {
                   printf("a=%d\tb=%d\tc=%d\n",a,b,3*c);
               }
           }
       }
   }
   return 0;
}