#include <stdio.h>
/*
比较符号:> >= < <=  == !=
比较的结果是一个布尔类型值:真或假
0表示假
非0 表示真
真一般表示1
假:一般表示0

逻辑符号:
&&:多个条件同时成立为真
||:多个条件中只要一个条件为真则为真
!:	取反
*/
int main(int argc, char const *argv[])
{
	// int a=5;
	// if(6<a<9)// 6<a  为假 0<9 为真
	// {
	// 	printf("ok");
	// }
	// else
	// {
	// 	printf("no");
	// }
	// int  a=0;
	// //if(a)
	// //if(!a)
 //    if(printf("hello world\n"))
 //    {	
	// 	printf("1\n");
	// }
	// else
	// {
	// 	printf("2\n");
	// }

    //int a=5,b=6;
    //if(a>6 && a<9)
    //if(a>6 || a<9)
    // if(a>6 || a<9  && a+b<20)//&&  优先级高于 ||
    // {
    // 	printf("1\n");
    // }
    // else
    // {
    // 	printf("2\n");
    // }
    //&&   || 短路问题:
    //&&:只要前面一个条件为假,后续条件不在处理
    // int a=5,b=6;
    // //if(a>6 &&  ++b<20)
    // //||:只要前面一个条件为真,后续条件不在处理
    // if(a<6 ||  ++b<20)
    // {

    // }
    // printf("a=%d\t b=%d\n",a,b);

	//张三说李四说谎,李四说王五说谎,王五说张三和李四都说谎
	// int  i_a,i_b,i_c;
	// //嵌套循环实现 值组合
	// for(i_a=0;i_a<2;i_a++)
	// {
	// 	for(i_b=0;i_b<2;i_b++)
	// 	{
	// 		for(i_c=0;i_c<2;i_c++)
	// 		{
	// 			if((i_a==1&&i_b==0 || i_a==0&&i_b==1)
	// 			   &&(i_b==1&&i_c==0 ||i_b==0&&i_c==1)
	// 			   &&(i_c==1&&i_a+i_b==0 || i_c==0&&i_a+i_b>0))
	// 			{
	// 				printf("a=%d\tb=%d\tc=%d\n",i_a,i_b,i_c);
	// 			}
	// 		}
	// 	}
	// }

	//100文钱买100只鸡,小鸡3只1文钱,母鸡5文钱,公鸡3文钱
	// int  i_x,i_y,i_z;
	// //嵌套循环实现组合
	// for(i_x=1;i_x<100;i_x++)
	// {
	// 	for(i_y=1;i_y<20;i_y++)
	// 	{
	// 		for(i_z=1;i_z<33;i_z++)
	// 		{
	// 			if(i_x+5*i_y+3*i_z==100 && 3*i_x+i_y+i_z==100)
	// 			{
	// 				printf("i_x=%d i_y=%d i_z=%d\n",3*i_x,i_y,i_z);
	// 			}
			
	// 		}
	// 	}
	// }
    //比较任意两个浮点数(双精度)是否相等?
	double d_a=11234.456465499964;
	double d_b=11234.456465499965;
	//if(d_a==d_b)//错误,不能直接比较
	if(abs(d_a-d_b)<=0.0000001)
	{
		printf("1\n");
	}
	else
	{
		printf("2\n");
	}
	return 0;
}
